Show / Hide Table of Contents
Class PrestressLoading
Prestress loading
Inheritance
System.Object
PrestressLoading
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.Load
Assembly: IdeaRS.OpenModel.dll
Syntax
public class PrestressLoading
Properties
Improve this Doc   View Source
PrimaryForces
Primary internal force in section
Declaration
public ResultOfInternalForces PrimaryForces { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
SecondaryForces
Secondary internal force in section
Declaration
public ResultOfInternalForces SecondaryForces { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
Time
Time
Declaration
public double Time { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source